Repository: AutoContCZ/AC-NAV-TranslationMemory
Catalog: TM_Helps_Final_Version.tmx
Source language: en_us
Languages: cs_cz

source: Set up the Incoming Documents feature and set up the OCR service.
cs_cz: Nastavení funkcí Došlých dokladů a nastavení služby OCR.

source: Create incoming document records, attach files, use OCR to turn PDF files into electronic documents, convert electronic documents to document records, audit incoming document records from posted sales and purchase documents.
cs_cz: Vytváření záznamů došlého dokladu, připojení souborů, použítí OCR k tomu, abyste soubory PDF převedli do elektronických dokladů a elektronické doklady na záznamy dokladů, auditovaly záznamy došlého dokladu ze zaúčtovaných prodejních a nákupních dokladů.

source: Dynamics NAV introduces the ability to manage business interactions with your customers and vendors, directly in Microsoft Outlook.
cs_cz: Dynamics NAV představuje schopnost řídit obchodní interakce se zákazníky a prodejci přímo v aplikaci Microsoft Outlook.

source: With the Dynamics NAV Outlook Add-in, you can see financial data related to customers and vendors, as well as create and send financial documents, such as quotes and invoices.
cs_cz: Pomocí doplňku Dynamics NAV Outlook můžete vidět finanční údaje týkající se zákazníků a prodejců a vytvářet a odesílat finanční doklady jako jsou například nabídky a faktury.

source: Some companies using Office 365 restrict users’ permissions to deploy add-ins.
cs_cz: Některé společnosti používající Office 365 omezují oprávnění uživatelů k nasazení doplňků.

source: So you must make sure that you have an Office 365 subscription that includes email and allows you to deploy add-ins.
cs_cz: Musíte se tedy ujistit, že máte předplatné Office 365, které obsahuje e-mail a umožňuje nasadit doplňky.

source: You can sign up for a 1-month free trial of Office 365 here.
cs_cz: Můžete se zaregistrovat na bezplatnou zkušební verzi Office 365 na 1 měsíc zde.

source: Get the add-in
cs_cz: Získání doplňku

source: In Dynamics NAV, one of the assisted setup guides is Set Up Office Add-Ins.
cs_cz: Jedním z pomocných nástrojů v Dynamics NAV pro nastavení je Nastavit doplňky Office.

source: The guide helps you set up a connection between your Office 365 account and Dynamics NAV.
cs_cz: Průvodce vám pomůže vytvořit spojení mezi vaším účtem Office 365 a Dynamics NAV.

source: The Dynamics NAV add-in is then automatically added to your Outlook.
cs_cz: Doplněk Dynamics NAV je potom automaticky přidán do aplikace Outlook.

source: The new add-in is added to the Outlook ribbon, and in Outlook Web Access, you can see it in the add-in ribbon, immediately above the body of the email message.
cs_cz: Nový doplněk je přidán do pásu karet aplikace Outlook a v aplikaci Outlook Web Access jej můžete vidět v doplňkovém pásu karet bezprostředně nad textem e-mailové zprávy.

source: Using the add-in
cs_cz: Použití doplňků

source: When you get a message from a customer, directly in Outlook, you can open the Dynamics NAV add-in, which recognizes the customer, and opens the customer card for his company.
cs_cz: Když obdržíte zprávu od zákazníka přímo v aplikaci Outlook, můžete otevřít doplněk Dynamics NAV, který zákazníka rozpozná a otevře klientskou kartu pro jeho společnost.

source: From this dashboard, you can see overview information for the customer, as well as drill down for more detail on specific documents.
cs_cz: Z tohoto řídícího panelu se zobrazují přehledné informace pro zákazníka a podrobnější informace o konkrétních dokladech.

source: You can also dig into the sales history for the customer.
cs_cz: Můžete také nahlédnout do historie prodeje pro zákazníka.

source: In the add-in, you can create a sales quote and send it back to this customer without leaving Outlook.
cs_cz: V doplňku můžete vytvořit prodejní nabídku a odeslat ji zpět tomuto zákazníkovi bez opuštění aplikace Outlook.

source: All of the information that you need to send the sales quote is available in your business inbox in Outlook.
cs_cz: Všechny informace, které potřebujete k odeslání prodejní nabídky, jsou k dispozici ve vaší firemní schránce v aplikaci Outlook.

source: Once you have the data entered, you can post the quote.
cs_cz: Jakmile zadáte data, můžete uveřejnit nabídku.

source: You can then send it by email.
cs_cz: Můžete je poslat e-mailem.

source: Dynamics NAV generates a .PDF file with the sales quote and attaches it to the email message that you draft in the add-in.
cs_cz: Dynamics NAV vygeneruje soubor s příponou .PDF s prodejní nabídkou a připojí jej k e-mailové zprávě, kterou vytvoříte v doplňku.

source: Similar experience applies to messages from your vendors and purchase documents.
cs_cz: Podobné zkušenosti se týkají zpráv od dodavatelů a nákupních dokladů.

source: Sometimes you want to see more fields that you can see in the add-in, such as when you want to fill in lines in an invoice.
cs_cz: Někdy chcete vidět více polí, které můžete mít v doplňku, například když chcete vyplnit řádky na faktuře.

source: To give you a bit more space to work with, you can pop out the add-in to a separate window.
cs_cz: Abyste si udělali více prostoru, můžete přidat doplněk do samostatného okna.

source: It's still part of Outlook, but you have more space.
cs_cz: Je to stále část aplikace Outlook, ale máte více prostoru.

source: As you enter data for the document in the pop-out view, the changes are automatically saved.
cs_cz: Při zadávání dat do dokumentu v rozbalovací nabídce se změny automaticky uloží.

source: When you are done entering data for the document, you can close the page.
cs_cz: Po dokončení zadávání dat pro dokument můžete stránku zavřít.

source: Choosing the add-in frame in Outlook automatically refreshes the document with the changes you made in the pop-out view.
cs_cz: Výběr doplňkového rámečku v aplikaci Outlook automaticky aktualizuje doklad se změnami, které jste provedli v rozbalovací nabídce.

source: Quick document lookup
cs_cz: Rychlé vyhledávání dokumentů

source: The Dynamics NAV Document Links add-in gives you quick access to documents mentioned in email messages.
cs_cz: Doplněk Dynamics NAV Document Links poskytuje rychlý přístup k dokladům uvedeným v e-mailových zprávách.

source: The add-in is available for an email message if a document number is recognized in the body of the message.
cs_cz: Doplněk je k dispozici pro e-mailovou zprávu, pokud je číslo dokladu rozpoznáno v textu zprávy.

source: Opening the add-in provides quick access to the document.
cs_cz: Otevření doplňku poskytuje rychlý přístup k dokladu.

source: For example, if you receive an email message that mentions the text S-QUO100, Dynamics NAV identifies that as a sales quote, and so you can open this document in Outlook.
cs_cz: Pokud například obdržíte e-mailovou zprávu, která uvádí text S-QUO100, Dynamics NAV toto identifikuje jako prodejní nabídka a proto můžete tento doklad otevřít v aplikaci Outlook.

source: In Outlook, choose the Document Links button immediately above the body of the email message.
cs_cz: V aplikaci Outlook vyberte tlačítko Odkazy na doklad bezprostředně nad textem e-mailové zprávy.

source: In the Outlook Web App, choose the S-QUO1001 text in the body of the email message.
cs_cz: Ve webové aplikaci Outlook vyberte text S-QUO1001 v textu e-mailové zprávy.

source: In the Document Links add-in, you can modify and take actions with the document, just like you can in Dynamics NAV.
cs_cz: V doplňku Document Links můžete upravovat a provádět akce s dokladem stejně jako v Dynamics NAV.

source: Using the Dynamics NAV Content Pack for Power BI
cs_cz: Použití balíčku obsahu Dynamics NAV pro Power BI

source: Getting insights into your Dynamics NAV data is easy with Power BI and the Dynamics NAV content pack.
cs_cz: Získejte přehled o vašich datech v Dynamics NAV pomocí funkce Power BI a balíčku obsahu Dynamics NAV.

source: Power BI retrieves your data and then builds an out-of-the-box dashboard and reports based on that data.
cs_cz: Power BI načítá vaše data a poté sestaví řídící panel a přehledy vycházející z těchto dat.

source: The content pack is preconfigured to work with sales data and financial data from the demonstration company that you get when you sign up for the Dynamics NAV preview.
cs_cz: Balíček obsahu je překonfigurován pro práci s prodejními a finančními daty od demonstrační společnosti, které získáte při registraci k Dynamics NAV.

source: Choose any visual on the dashboard to bring up one of seven underlying reports.
cs_cz: Vyberte si jakýkoli vizuál na řídícím panelu, abyste získali jednu ze sedmi podkladových zpráv.

source: Filter the report or add fields that you want to monitor.
cs_cz: Filtrování sestavy nebo přidání polí, které chcete sledovat.

source: Pin this customized view to the dashboard to continue tracking.
cs_cz: Připojte toto přizpůsobené zobrazení k řídicímu panelu a pokračujte ve sledování.

source: The dashboard and underlying reports refresh daily.
cs_cz: Řídicí panel a podkladové zprávy se denně aktualizují.

source: You can control the refresh schedule and modify the frequency on the dataset.
cs_cz: Můžete upravit plán obnovení a upravit frekvenci v datovém souboru.

source: Accessing Dynamics NAV in Power BI
cs_cz: Přístup k Dynamics NAV v Power BI

source: To see your Dynamics NAV data in Power BI, you must have the following:
cs_cz: Chcete-li zobrazit údaje Dynamics NAV v Power BI, musíte mít následující:

source: Access to Dynamics NAV.
cs_cz: Přístup k Dynamics NAV.

source: For more information, see Dynamics NAV.
cs_cz: Další informace naleznete v tématu Dynamics NAV.

source: Access to Power BI.
cs_cz: Přístup k Power BI.

source: For more information, see Power BI.
cs_cz: Další informace naleznete v tématu Power BI.

source: On the Power BI site, you can find additional information about adding the Dynamics NAV content pack to Power BI.
cs_cz: Na webu Power BI naleznete další informace o přidání balíčku obsahu Dynamics NAV do Power BI. Přidání balíčku obsahu Dynamics NAV k Power BI.

source: To access the Dynamics NAV content pack in Power BI, in the connection window, you must specify the following information:
cs_cz: Chcete-li získat přístup k sadě obsahu Dynamics NAV v Power BI, v okně připojení musíte zadat následující informace:

source: Field
cs_cz: Pole

source: The OData URL so Power BI can access data from your company, such as https://mybusiness.com:7048/MS/OData/Company('CRONUS%20US').
cs_cz: OData URL, takže Power BI může mít přístup k datům od vaší společnosti, například https://mybusiness.com:7048/MS/OData/Company('CRONUS%20US').

source: Authentication method
cs_cz: Metoda ověřování

source: Choose Basic.
cs_cz: Zvolte Základní.

source: User name
cs_cz: Uživatelské jméno

source: The email account that you used to sign up for Dynamics NAV, such as .
cs_cz: E-mailový účet, který jste použili k registraci pro službu Dynamics NAV například .

source: Password
cs_cz: Heslo

source: This is the web service access key for your user account in Dynamics NAV.
cs_cz: Toto je klíč pro přístup k webovým službám pro váš uživatelský účet v Dynamics NAV.

source: This means that you must get two pieces of information from Dynamics NAV:
cs_cz: Toto znamená, že musíte získat dvě informace z Dynamics NAV:

source: The OData URL and the web service access key for your user account.
cs_cz: OData URL a klíč pro přístup k webové službě pro váš uživatelský účet.

source: Getting the URL
cs_cz: Získání adresy URL

source: When you add Dynamics NAV to Power BI, you must specify a URL so Power BI can access data from your company.
cs_cz: Pokud přidáte Dynamics NAV k Power BI, musíte zadat adresu URL, aby mohl mít Power BI přístup k datům vaší společnosti.

source: In the connection window, the URL is referred to as the OData Feed URL, and it must have the following format:
cs_cz: V okně připojení je adresa URL označována jako OData Feed URL a musí mít následující formát:

source: In this example, mybusiness is the name of your Dynamics NAV service, and CRONUS US is the name of the demonstration company with %20 representing the space in the name.
cs_cz: V tomto příkladu je mybusiness název služby Dynamics NAV a CRONUS US je název demonstrační společnosti s %20 reprezentujícím mezeru v názvu.

source: To get the URL, in Dynamics NAV, search for and open the Web Services window.
cs_cz: Chcete-li získat adresu URL, v aplikaci Dynamics NAV vyhledejte a otevřete okno Webové služby.

source: This window lists the web services that are currently available, and you can copy the link from the OData URL field for one of the default OData web services.
cs_cz: Toto okno obsahuje seznam webových služeb, které jsou aktuálně k dispozici a můžete zkopírovat odkaz z pole OData URL pro jednu z výchozích webových služeb OData.

source: Getting the web service access key
cs_cz: Získání klíče pro přístup k webové službě

source: In order to use data from Dynamics NAV, in Power BI, in the Connect to Dynamics NAV window, you must specify your user name, which is your email account, and a password.
cs_cz: Chcete-li v okně Připojení k Dynamics NAV použít data ze služby Dynamics NAV v Power BI, musíte zadat uživatelské jméno, kterým je váš e-mailový účet a heslo.

source: The password is the web service access key that is set up for your user account in Dynamics NAV.
cs_cz: Heslo je klíč pro přístup k webové službě, který je nastaven pro váš uživatelský účet v Dynamics NAV.

source: To get a web service access key, in Dynamics NAV, search for the Users window, and then open the card for your user account.
cs_cz: Chcete-li získat klíč pro přístup k webové službě, vyhledejte v aplikaci Dynamics NAV okno Uživatelé a poté otevřete kartu pro svůj uživatelský účet.

source: On the Web Service Access FastTab, copy the contents of the Web Service Access Key field.
cs_cz: Na webové službě Access zkopírujte obsah pole Klíč webové služby Access.

source: If the field is blank, in the ribbon, choose Change Web Service Access Key, choose the Key Never Expires field, and then choose the OK button.
cs_cz: Pokud je pole prázdné, v pásu karet vyberte možnost Změnit klíč webové služby Access, vyberte pole Klíč nikdy nevyprší a potom klepněte na tlačítko OK.

source: You can then copy the key.
cs_cz: Potom můžete klíč zkopírovat.

source: Getting Data from Dynamics NAV
cs_cz: Získání dat z Dynamics NAV

source: The Dynamics NAV dashboard shows the most typical reports that you will want to use to track your business.
cs_cz: Na řídícím panelu Dynamics NAV se zobrazují nejtypičtější zprávy, které budete chtít použít ke sledování vaší firmy.

source: The data is extracted from your Dynamics NAV company using web services to read live data.
cs_cz: Data jsou získána z vaší společnosti Dynamics NAV pomocí webových služeb pro čtení reálných dat.

source: In Dynamics NAV, the Web Services window lists the web services that have been set up for you, including the following that are consumed by the content pack in Power BI:
cs_cz: V okně Dynamics NAV Webové služby jsou seznamy webových služeb, které byly pro vás nastaveny včetně následujících, které spotřebovává balíček obsahu v Power BI:

source: If you change the name of any of these web services, the data will not show up in Power BI.
cs_cz: Pokud změníte název některé z těchto webových služeb, data se nebudou zobrazovat v Power BI.

source: If you want to add use other data in Power BI, you must find the tables in Dynamics NAV, expose them as web services, and then add them to the content pack.
cs_cz: Chcete-li přidat další údaje do Power BI, musíte najít tabulky v Dynamics NAV, zobrazit je jako webové služby a přidat je do obsahu.

source: This is an advanced scenario, and we recommend that you start with the data that is already available in Power BI.
cs_cz: Jedná se o pokročilý scénář a doporučujeme začít s údaji, které jsou již k dispozici v Power BI.

source: Troubleshooting
cs_cz: Odstraňování problémů

source: The Power BI dashboard relies on the published web services that are listed above, and it will show data from the demonstration company or your own company if you import data from your current finance-setup solution.
cs_cz: Řídicí panel Power BI se spoléhá na publikované webové služby, které jsou uvedeny výše a bude zobrazovat data od demonstrační společnosti nebo vlastní firmy, pokud importujete data z vašeho aktuálního řešení finančního nastavení.

source: However, if something goes wrong, this section provides a workaround for the most typical issues.
cs_cz: Pokud se však něco pokazí, tato část poskytuje řešení pro nejtypičtějších problémy.

source: "Parameter validation failed, please make sure all parameters are valid"
cs_cz: "Ověření parametrů se nezdařilo, zkontrolujte, zda jsou všechny parametry platné“

source: If you see this error after you enter your Dynamics NAV URL, make sure the following requirements are satisfied:
cs_cz: Pokud se vám tato chyba zobrazí po zadání adresy URL služby Dynamics NAV, ujistěte se, že jsou splněny následující požadavky:

source: The URL follows exactly this pattern:
cs_cz: Adresa URL přesně odpovídá tomuto vzoru:

source: Delete any text after the company name in parenthesis
cs_cz: Odstraňte jakýkoli text za názvem společnosti v závorkách

source: Make sure there are no trailing forward slash at the end of the URL.
cs_cz: Ujistěte se, že na konci adresy URL nejsou žádná lomítka.

source: Make sure that it is a secure connection as indicated by the URL starting with https.
cs_cz: Ujistěte se, že se jedná o zabezpečené připojení, jak je uvedeno na adrese URL začínající https.

source: "Login failed"
cs_cz: "Přihlášení se nezdařilo“

source: If you get a "login failed" error when you log in to the dashboard, using your Dynamics NAV credentials, then this can be caused by one of the following issues:
cs_cz: Pokud při přihlašování k řídicímu panelu se pomocí přihlašovacích údajů Dynamics NAV zobrazí chyba "přihlášení se nezdařilo", může to být způsobeno jedním z následujících problémů:

source: The account you are using does not have permissions to read the Dynamics NAV data from your account.
cs_cz: Účet, který používáte, nemá oprávnění ke čtení dat Dynamics NAV z vašeho účtu.

source: Verify your user account in Dynamics NAV, and make sure that you have used the right web service access key as the password, and then try again.
cs_cz: Ověřte svůj uživatelský účet v aplikaci Dynamics NAV a ujistěte se, že jste použili správný přístupový klíč webové služby jako heslo a zkuste to znovu.

source: The Dynamics NAV instance that you are trying to connect to does not have a valid SSL certificate.
cs_cz: Instance Dynamics NAV, ke které se pokoušíte připojit, nemá platný certifikát SSL.

source: In this case you'll see a more detailed error message ("unable to establish trusted SSL relationship").
cs_cz: V takovém případě se zobrazí podrobnější chybová zpráva ("nelze vytvořit důvěryhodný vztah SSL").

source: Self-signed certificates are not supported.
cs_cz: Samostatně podepsané certifikáty nejsou podporovány.

source: "Oops"
cs_cz: "Ups“

source: If you see an "Oops" error dialog after you pass the authentication dialog, this is most frequently caused by a problem connecting to the data for the content pack.
cs_cz: Zobrazí-li dialogové okno chybu "Ups" po zadání ověřování dialogového okna, je to nejčastěji způsobeno problémem s připojením k datům pro obsahový balíček.

source: Verify that the URL follows the pattern that was specified earlier:
cs_cz: Ověřte, zda adresa URL odpovídá vzoru uvedenému dříve:

source: A common mistake is to specify the full URL for a specific web service:
cs_cz: Obvyklou chybou je nezadání úplné adresy URL konkrétní webové služby:

source: Or you might have forgotten to specify the company name:
cs_cz: Nebo jste možná zapomněli zadat název společnosti:

source: Alternatively, you can send the file to the OCR service by email.
cs_cz: Případně můžete odeslat soubor službě OCR e-mailem.

source: Create incoming document records manually or automatically by taking a photo of a paper receipt, for example.
cs_cz: Vytváření záznamů došlého dokladu ručně nebo automaticky tak, že například pořídíte fotografii dokladu.

source: Use an OCR service to turn PDF and image files into electronic documents that can be converted to purchase invoices in Dynamics NAV, for example.
cs_cz: Služba OCR slouží k převodu souborů PDF a obrázkových souborů na elektronické doklady, které lze například převést na faktury v Dynamics NAV.

source: Train the OCR service to avoid errors next time it processes similar data.
cs_cz: Zlepšete službu OCR, abyste předešli chybám při příštím zpracování podobných dat.

source: Connect or remove incoming document records for any non-posted sales or purchase document and to any customer, vendor, or general ledger entry from the document or entry.
cs_cz: Připojení nebo odstranění záznamů došlého dokladu pro jakýkoli nezaúčtovaný prodejní nebo nákupní doklad a jakýkoliv záznam zákazníka, dodavatele nebo položky hlavní knihy z dokladu nebo položky.

source: From the Chart of Accounts and General Ledger Entries windows, use a search function to find general ledger entries for posted documents that do not have incoming document records and then centrally link to existing records or create new ones with attached document files.
cs_cz: Z oken Účetní osnova a Položky hlavní knihy použijte vyhledávací funkci pro nalezení položek hlavní knihy pro zaúčtované doklady, které nemají záznamy došlého dokladu a poté centrálně odkazují na existující záznamy nebo vytvářejí nové soubory s připojenými doklady.

source: Get better overview by setting incoming document records to Processed to remove them from the default view.
cs_cz: Získejte lepší přehled nastavením záznamů došlého dokladu na Zpracované, abyste jej odstranili z výchozího zobrazení.

source: Reconcile Bank Accounts Separately
cs_cz: Separátní odsouhlasení bankovních účtů

source: To reconcile bank accounts in Dynamics NAV with statements received from the bank, you must fill the lines in the Bank Acc. Reconciliation window.
cs_cz: Chcete-li odsouhlasit bankovní účty v systému Dynamics NAV s výpisy přijatými z banky, musíte vyplnit řádky v okně Odsouhlasení bank. účtu.

source: You can also reconcile bank accounts in the Payment Reconciliation Journal window.
cs_cz: Bankovní účty můžete také odsouhlasit v okně Deník odsouhlasení plateb.

source: Any open bank account ledger entries related to the applied customer or vendor ledger entries will be closed when you choose the Post Payments and Reconcile Bank Account action.
cs_cz: Veškeré položky bankovních účtů, které se vztahují k položkám účtů zákazníků nebo dodavatelů budou uzavřeny, když zvolíte akci Zaúčtování plateb a odsouhlasení bankovních účtů.

source: This means that the bank account is automatically reconciled for payments that you post with the journal.
cs_cz: To znamená, že bankovní účet je automaticky odsouhlasen pro platby, které zaúčtujete do deníku.

source: Reconcile Payments Using Automatic Application .
cs_cz: Odsouhlasení plateb pomocí automatického vyrovnání .

source: To enable import of bank statements as bank feeds, you must first set up and enable the Envestnet Yodlee Bank Feed service, and then link your bank accounts to the related online bank accounts.
cs_cz: Chcete-li povolit import bankovních výpisů jako bankovních zdrojů, musíte nejprve nastavit a aktivovat službu Envestnet Yodlee Bank Feed a pak propojit své bankovní účty se souvisejícími online bankovními účty.

source: Set Up the Envestnet Yodlee Bank Feeds Service .
cs_cz: Nastavení služby Envestnet Yodlee Bank Feeds .

source: The Envestnet Yodlee Bank Feeds service, or anther provider's bank feed service, may not be available in your system.
cs_cz: Služba Envestnet Yodlee Bank Feeds nebo jiná služba bankovního doručovatele nemusí být ve vašem systému k dispozici.
